lvx/base/InformationRegisters/бит_рлс_ПраваДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_рлс_ПраваДоступа</Name>
			<Comment>(RLS)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Comment>Право на чтение</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Comment>Право на запись</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследования</Name>
					<Comment>Вид наследования</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_рлс_ВидыНаследованияПрав</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидНастройки</Name>
					<Comment>Вид настройки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_рлс_ВидыНастроекПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбластиДоступа</Name>
					<Comment>Вид области доступа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_рлс_ВидыОбластейДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель_1</Name>
					<Comment>Разделитель прав доступа № 1. По умолчанию ЦФО.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:EnumRef.бит_рлс_Все</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель_2</Name>
					<Comment>Разделитель прав доступа № 2. По умолчанию - статья оборотов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
						<v8:Type>cfg:EnumRef.бит_рлс_Все</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель_3</Name>
					<Comment>Разделитель прав доступа № 3. По умолчанию - пользователь.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:EnumRef.бит_рлс_Все</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель_4</Name>
					<Comment>Разделитель прав доступа № 4. По умолчанию - проект.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_рлс_Все</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_рлс_ВидыОбластейДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_рлс_ВидыОбластейДоступа</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЦФОСтатьиОборотов</Name>
					<Comment>ЦФО &amp; Статьи оборотов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Пользователи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
					<Comment>Проекты</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Enums/бит_рлс_ВидыНастроекПрав.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_рлс_ВидыНастроекПрав</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доступ</Name>
					<Comment>Доступ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Запрет</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/CommonModules/бит_УправлениеДоступомБФСлужебный/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Определяет доступность объекта
// Параметры:
//  ПроверочнаяТаблица	 - ДокументТабличнаяЧасть - табличная часть проверяемого документа.
//  НаименованиеТаблицы	 - Строка	 -  наименование табличной части.
// 
// Возвращаемое значение:
//  Булево - доступность объекта.
//
Функция ДоступЗапрещен(ПроверочнаяТаблица, НаименованиеТаблицы, Запись = Ложь) Экспорт
	
	// ++ЕРП
	Возврат Ложь;
	// --ЕРП
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если у пользователя роль "Финансист - полные права", проверку доступности объекта не проводим.
	Если ПравоДоступа("Изменение", Метаданные.Справочники.Подразделения)
		И ПравоДоступа("Изменение", Метаданные.Справочники.бит_СтатьиОборотов) Тогда
	    Возврат Ложь;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	СлужебнаяТаблица = ПроверочнаяТаблицаПоУмолчанию();
	Для каждого СтрокаТаблицы Из ПроверочнаяТаблица Цикл
		НоваяСтрока = СлужебнаяТаблица.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
	КонецЦикла;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ПроверочнаяТаблица",  СлужебнаяТаблица);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПроверочнаяТаблица.НомерСтроки КАК НомерСтроки,
	|	ПроверочнаяТаблица.ЦФО КАК ЦФО,
	|	ПроверочнаяТаблица.СтатьяОборотов КАК СтатьяОборотов,
	|	ПроверочнаяТаблица.Проект КАК Проект
	|ПОМЕСТИТЬ ПроверочнаяТаблица
	|ИЗ
	|	&ПроверочнаяТаблица КАК ПроверочнаяТаблица";
	
	Если ТипЗнч(ПроверочнаяТаблица) = Тип("ДокументТабличнаяЧасть.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПроверочнаяТаблица.СтатьяОборотов", "ПроверочнаяТаблица.СтатьяОборотовНачисления"); 
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ДоступЗапрещен = Ложь;
	ВидОграничения = ?(Запись, "записи", "чтения");	
	Если ПараметрыСеанса.бит_рлс_ЦФОСтатьиОборотов Тогда
		Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
		Запрос.УстановитьПараметр("ГруппыТекущегоПользователя", ПараметрыСеанса.бит_рлс_ГруппыТекущегоПользователя);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверочнаяТаблица.НомерСтроки КАК НомерСтроки,
		|	ПроверочнаяТаблица.ЦФО КАК ЦФО,
		|	ПроверочнаяТаблица.СтатьяОборотов КАК СтатьяОборотов
		|ПОМЕСТИТЬ Доступные
		|ИЗ
		|	ПроверочнаяТаблица КАК ПроверочнаяТаблица
		|ГДЕ
		|	1 В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				1 КАК ЕстьОтбор
		|			ИЗ
		|				РегистрСведений.бит_рлс_ПраваДоступа КАК ПраваДоступа
		|			ГДЕ
		|				ПраваДоступа.ВидОбластиДоступа = ЗНАЧЕНИЕ(Перечисление.бит_рлс_ВидыОбластейДоступа.ЦФОСтатьиОборотов)
		|				И ПраваДоступа.ВидНастройки = ЗНАЧЕНИЕ(Перечисление.бит_рлс_ВидыНастроекПрав.Доступ)
		|				И ПраваДоступа.Чтение = ИСТИНА
		|				И (ПраваДоступа.Пользователь = &ТекущийПользователь
		|					ИЛИ ПраваДоступа.Пользователь В (&ГруппыТекущегоПользователя))
		|				И (ПраваДоступа.Разделитель_1 = ПроверочнаяТаблица.ЦФО
		|						И ПраваДоступа.Разделитель_2 = ПроверочнаяТаблица.СтатьяОборотов
		|					ИЛИ ПраваДоступа.Разделитель_1 = ПроверочнаяТаблица.ЦФО
		|						И ПраваДоступа.Разделитель_2 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|					ИЛИ ПраваДоступа.Разделитель_1 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|						И ПраваДоступа.Разделитель_2 = ПроверочнаяТаблица.СтатьяОборотов
		|					ИЛИ ПраваДоступа.Разделитель_1 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|						И ПраваДоступа.Разделитель_2 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)))
		|	И НЕ -1 В
		|				(ВЫБРАТЬ ПЕРВЫЕ 1
		|					-1 КАК ЕстьОтбор
		|				ИЗ
		|					РегистрСведений.бит_рлс_ПраваДоступа КАК ПраваДоступа
		|				ГДЕ
		|					ПраваДоступа.ВидОбластиДоступа = ЗНАЧЕНИЕ(Перечисление.бит_рлс_ВидыОбластейДоступа.ЦФОСтатьиОборотов)
		|					И ПраваДоступа.ВидНастройки = ЗНАЧЕНИЕ(Перечисление.бит_рлс_ВидыНастроекПрав.Запрет)
		|					И ПраваДоступа.Чтение = ИСТИНА
		|					И (ПраваДоступа.Пользователь = &ТекущийПользователь
		|						ИЛИ ПраваДоступа.Пользователь В (&ГруппыТекущегоПользователя))
		|					И (ПраваДоступа.Разделитель_1 = ПроверочнаяТаблица.ЦФО
		|							И ПраваДоступа.Разделитель_2 = ПроверочнаяТаблица.СтатьяОборотов
		|						ИЛИ ПраваДоступа.Разделитель_1 = ПроверочнаяТаблица.ЦФО
		|							И ПраваДоступа.Разделитель_2 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|						ИЛИ ПраваДоступа.Разделитель_1 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|							И ПраваДоступа.Разделитель_2 = ПроверочнаяТаблица.СтатьяОборотов
		|						ИЛИ ПраваДоступа.Разделитель_1 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)
		|							И ПраваДоступа.Разделитель_2 = ЗНАЧЕНИЕ(Перечисление.бит_рлс_Все.Все)))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПроверочнаяТаблица.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ПроверочнаяТаблица КАК ПроверочнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Доступные КАК Доступные
		|		ПО ПроверочнаяТаблица.ЦФО = Доступные.ЦФО
		|			И ПроверочнаяТаблица.СтатьяОборотов = Доступные.СтатьяОборотов
		|ГДЕ
		|	(Доступные.ЦФО ЕСТЬ NULL
		|			ИЛИ Доступные.СтатьяОборотов ЕСТЬ NULL)";
		
		Если Запись Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПраваДоступа.Чтение", "ПраваДоступа.Запись");
			
		КонецЕсли;
		
		Результат = Запрос.Выполнить();
	 
	 	Выборка = Результат.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru='В строке №%1 табличной части ""%2"" обнаружено сочетание ЦФО/Статья оборотов запрещенное для %3.';
							  |en='In line №%1 of the table part ""%2"", unavailable combination of the CFR/article of turns for %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НомерСтроки, НаименованиеТаблицы, ВидОграничения);					 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			
			ДоступЗапрещен = Истина;
		КонецЦикла;
		
	КонецЕсли;

	Если ПараметрыСеанса.бит_рлс_Проекты Тогда
		
		Если Запись Тогда
			ПроектыДоступВсе = ПараметрыСеанса.бит_ПроектыДоступЗаписьВсе;
			ПроектыДоступ = ПараметрыСеанса.бит_ПроектыДоступЗапись;
			ПроектыЗапрет = ПараметрыСеанса.бит_ПроектыЗапретЗапись;
		Иначе
			ПроектыДоступВсе = ПараметрыСеанса.бит_ПроектыДоступЧтениеВсе;
			ПроектыДоступ = ПараметрыСеанса.бит_ПроектыДоступЧтение;
			ПроектыЗапрет = ПараметрыСеанса.бит_ПроектыЗапретЧтение;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПроектыДоступВсе", ПроектыДоступВсе);
		Запрос.УстановитьПараметр("ПроектыДоступ", ПараметрыСеанса.бит_ПроектыДоступЧтение);
		Запрос.УстановитьПараметр("ПроектыЗапрет", ПараметрыСеанса.бит_ПроектыЗапретЧтение);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроверочнаяТаблица.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	ПроверочнаяТаблица КАК ПроверочнаяТаблица
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПроектыДоступВсе
		|				ТОГДА ПроверочнаяТаблица.Проект В (&ПроектыЗапрет)
		|			ИНАЧЕ НЕ ПроверочнаяТаблица.Проект В (&ПроектыДоступ)
		|		КОНЕЦ";
		
		Если Запись Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПраваДоступа.Чтение", "ПраваДоступа.Запись");
		КонецЕсли;
				
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru='В строке №%1 табличной части ""%2"" обнаружен проект запрещенный для %3.';
							  |en='In line №%1 of the table part ""%2"" detected unavailable project for %3.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, Выборка.НомерСтроки, НаименованиеТаблицы, ВидОграничения);					 
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
			
			ДоступЗапрещен = Истина;
		КонецЦикла;
	
	КонецЕсли; 
		
	Возврат ДоступЗапрещен;
	
КонецФункции

// Проверяет, используется ли ограничение доступа на уровне записей.
//
// Возвращаемое значение:
//  Булево - если Истина, тогда доступ ограничивается на уровне записей.
//
Функция ОграничиватьДоступНаУровнеЗаписей() Экспорт
	
	Результат = бит_УправлениеДоступомБФСлужебныйПовтИсп.КонстантаИспользоватьРазделениеДоступаНаУровнеЗаписей();
	  
	Возврат Результат;
	
КонецФункции

Функция ДанныеПозицийПоЗаявке(Заявка) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеПозиций.ЦФО КАК ЦФО,
		|	ДанныеПозиций.СтатьяОборотов КАК СтатьяОборотов
		|ИЗ
		|	ЖурналДокументов.бит_кзн_Позиции КАК ДанныеПозиций
		|ГДЕ
		|	ДанныеПозиций.ДокументПланирования = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор параметра "ПроверочнаяТаблица" функции "ДоступЗапрещен"
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПроверочнаяТаблицаПоУмолчанию()
	
	ПроверочнаяТаблица = Новый ТаблицаЗначений;
	ПроверочнаяТаблица.Колонки.Добавить("НомерСтроки",    ОбщегоНазначения.ОписаниеТипаЧисло(10));
	ПроверочнаяТаблица.Колонки.Добавить("ЦФО",            Новый ОписаниеТипов("СправочникСсылка.Подразделения"));
	ПроверочнаяТаблица.Колонки.Добавить("СтатьяОборотов", Новый ОписаниеТипов("СправочникСсылка.бит_СтатьиОборотов"));
	ПроверочнаяТаблица.Колонки.Добавить("Проект",         Новый ОписаниеТипов("СправочникСсылка.Проекты"));
	Возврат ПроверочнаяТаблица;
	
КонецФункции

#КонецОбласти
